In [1]:
data = [
    {'id': 1, 'name': 'name1', 'age': 25},
    {'id': 5, 'name': 'name2', 'age': 28},
    {'id': 8, 'name': 'name3', 'age': 30},
    {'id': 15, 'name': 'name4', 'age': 35},
    {'id': 2, 'name': 'name5', 'age': 42},
    {'id': 440, 'name': 'name6', 'age': 36},
    {'id': 1005, 'name': 'name7', 'age': 19},
    {'id': 19, 'name': 'name8', 'age': 23},
    {'id': 23, 'name': 'name9', 'age': 55},
    {'id': 38, 'name': 'name10', 'age': 70},
    {'id': 16, 'name': 'name11', 'age': 26},
    {'id': 29, 'name': 'name12', 'age': 41}
]

In [5]:
import pandas as pd

df_data = pd.DataFrame(data)
# 1. select * from data
df_data[:]

      id    name  age
0      1   name1   25
1      5   name2   28
2      8   name3   30
3     15   name4   35
4      2   name5   42
5    440   name6   36
6   1005   name7   19
7     19   name8   23
8     23   name9   55
9     38  name10   70
10    16  name11   26
11    29  name12   41

In [6]:
# 2. select * from data limit(10)
df_data[:10]

     id    name  age
0     1   name1   25
1     5   name2   28
2     8   name3   30
3    15   name4   35
4     2   name5   42
5   440   name6   36
6  1005   name7   19
7    19   name8   23
8    23   name9   55
9    38  name10   70

In [7]:
# 3. select id from data
df_data['id']

0        1
1        5
2        8
3       15
4        2
5      440
6     1005
7       19
8       23
9       38
10      16
11      29
Name: id, dtype: int64

In [8]:
# 4. select count(id) from data
len(df_data['id'])

12

In [9]:
# 5. select * from data where id <1000 and age >30
df_data.query('id<1000 and age>30')

     id    name  age
3    15   name4   35
4     2   name5   42
5   440   name6   36
8    23   name9   55
9    38  name10   70
11   29  name12   41

In [11]:
# 6. select id, count(distinct orderid) from data group by id
data2 = [
    {'id': 1, 'orderid': 1},
    {'id': 1, 'orderid': 2},
    {'id': 1, 'orderid': 3},
    {'id': 2, 'orderid': 4},
    {'id': 2, 'orderid': 5},
    {'id': 3, 'orderid': 6},
    {'id': 3, 'orderid': 7},
    {'id': 4, 'orderid': 8},
    {'id': 5, 'orderid': 9},
    {'id': 5, 'orderid': 10},
]
df_data2 = pd.DataFrame(data2)
df_data2.groupby('id')['orderid'].count()

id
1    3
2    2
3    2
4    1
5    2
Name: orderid, dtype: int64

In [17]:
# 7. select * from table1 t1 inner_join table2 t2 on t1.id = t2.id
t1 = [
    {'id': 1, 'name': 'name1'},
    {'id': 2, 'name': 'name2'},
    {'id': 3, 'name': 'name3'},
    {'id': 4, 'name': 'name4'},
    {'id': 5, 'name': 'name5'},
    {'id': 6, 'name': 'name6'},
    {'id': 7, 'name': 'name7'},
    {'id': 10, 'name': 'name8'},
]
t2 = [
    {'id': 1, 'age': 21},
    {'id': 2, 'age': 39},
    {'id': 3, 'age': 43},
    {'id': 4, 'age': 28},
    {'id': 5, 'age': 19},
    {'id': 6, 'age': 52},
    {'id': 7, 'age': 36},
    {'id': 8, 'age': 62},
]
df_t1 = pd.DataFrame(t1)
df_t2 = pd.DataFrame(t2)
df_t1.join(df_t2, on="id", how="inner", lsuffix="_left", rsuffix="_right")

   id  id_left   name  id_right  age
0   1        1  name1         2   39
1   2        2  name2         3   43
2   3        3  name3         4   28
3   4        4  name4         5   19
4   5        5  name5         6   52
5   6        6  name6         7   36
6   7        7  name7         8   62

In [18]:
# 8. select * from t1 union select * from t2
pd.concat([df_t1, df_t2], ignore_index=True).drop_duplicates().reset_index(drop=True)

    id   name   age
0    1  name1   NaN
1    2  name2   NaN
2    3  name3   NaN
3    4  name4   NaN
4    5  name5   NaN
5    6  name6   NaN
6    7  name7   NaN
7   10  name8   NaN
8    1    NaN  21.0
9    2    NaN  39.0
10   3    NaN  43.0
11   4    NaN  28.0
12   5    NaN  19.0
13   6    NaN  52.0
14   7    NaN  36.0
15   8    NaN  62.0

In [19]:
# 9. delete from t1 where id=10
df_t1_new = df_t1.drop(df_t1[df_t1.id == 10].index)
df_t1_new

   id   name
0   1  name1
1   2  name2
2   3  name3
3   4  name4
4   5  name5
5   6  name6
6   7  name7

In [22]:
# 10. alter table t1 drop column name
df_t1_dc = df_t1.drop('name', axis=1)
df_t1_dc

   id
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7  10